src/InformationRegisters/Scan_Обмен1БДОтправленныеЗаявкиВ1БД/Scan_Обмен1БДОтправленныеЗаявкиВ1БД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_Обмен1БДОтправленныеЗаявкиВ1БД</name>
  <resources>
    <name>GuidЗаявки1БД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаявкаНаСервисныеРаботы</name>
    <type>
      <types>DocumentRef.Scan_ЗаявкаНаСервисныеРаботы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <comment>Продукт</comment>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаОбращения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_Обмен1БДОтправленныеЗаявкиВ1БД/ManagerModule.bsl
//rarus tenkam 16.02.2018 mantis 9428 +++ интеграция

Функция ДанныеПоДокументуОтправленыв1БД(ЗаявкаНаСервисныеРаботы) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_Обмен1БДОтправленныеЗаявкиВ1БД.GuidЗаявки1БД КАК GuidЗаявки1БД
		|ИЗ
		|	РегистрСведений.Scan_Обмен1БДОтправленныеЗаявкиВ1БД КАК Scan_Обмен1БДОтправленныеЗаявкиВ1БД
		|ГДЕ
		|	Scan_Обмен1БДОтправленныеЗаявкиВ1БД.ЗаявкаНаСервисныеРаботы = &ЗаявкаНаСервисныеРаботы";
	
	Запрос.УстановитьПараметр("ЗаявкаНаСервисныеРаботы", ЗаявкаНаСервисныеРаботы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;  
	
	Возврат Ложь;
	
КонецФункции

//rarus tenkam 16.02.2018 mantis 9428 --- интеграция
